asd74588/test1/MDK-ARM/.pack/Keil/STM32L4xx_DFP.1.4.0/SVD/STM32L4x2_v1r1.svd
        <register>
          <name>OPAMP2_CSR</name>
          <displayName>OPAMP2_CSR</displayName>
          <description>OPAMP2 control/status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>Operational amplifier
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPALPM</name>
              <description>Operational amplifier Low Power
              Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMODE</name>
              <description>Operational amplifier PGA
              mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PGA_GAIN</name>
              <description>Operational amplifier Programmable
              amplifier gain value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VM_SEL</name>
              <description>Inverting input selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>Non inverted input
              selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALON</name>
              <description>Calibration mode enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALSEL</name>
              <description>Calibration selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USERTRIM</name>
              <description>allows to switch from
              &#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#185;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#226;&#8364;&#339;factory&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#190;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;
              AOP offset trimmed values to AOP offset
              &#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#185;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#226;&#8364;&#339;user&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#190;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
